//===================================================================================
// # 6 Напишите программу, которая на вход принимает число и выдаёт,
// является ли число чётным (делится ли оно на два без остатка).
//===================================================================================

string? inputLine = Console.ReadLine();

if (inputLine != null)
{
    int inputNumber = int.Parse(inputLine);

    Console.WriteLine((inputNumber % 2 != 0 ? "Нечётное " : "Чётное ") + "число");
}