//===================================================================================
// # 14 Напишите программу, которая будет принимать на вход число и проверяет,
// кратно ли оно одновременно 7 и 23.
//===================================================================================

// Вариант Евгения
Console.Write("Введите число: ");
string? inputLine = Console.ReadLine();
int inputNumber = int.Parse(inputLine);

if (inputNumber % 7 == 0 && inputNumber % 23 == 0)
{
    Console.WriteLine("Число кратно 7 и 23");
}
else
{
    Console.WriteLine("Число не кратно 7 и 23");
}